#Requires AutoHotkey v2.0

#UseHook True

; ======================================================
; ПРАВЫЙ ALT (>!) -> НЕМЕЦКИЕ БУКВЫ
; Маленькие: Right Alt + буква
; Заглавные: Right Alt + Left Ctrl + буква
; ======================================================
>!a::Send "ä"
>!<^a::Send "Ä"

>!o::Send "ö"
>!<^o::Send "Ö"

>!u::Send "ü"
>!<^u::Send "Ü"

>!s::Send "ß"


; ======================================================
; ЛЕВЫЙ ALT (<! ) -> УКРАИНСКИЕ БУКВЫ
; Маленькие: Left Alt + клавиша
; Заглавные: Left Alt + Left Ctrl + клавиша
; ======================================================

; LAlt + S -> і / І
<!s::Send "і"
<!<^s::Send "І"

; LAlt + ] -> ї / Ї
<!]::Send "ї"
<!<^]::Send "Ї"

; LAlt + ' -> є / Є
<!'::Send "є"
<!<^'::Send "Є"

; LAlt + U -> ґ / Ґ
<!u::Send "ґ"
<!<^u::Send "Ґ"